Documents/УЧ_ПереоценкаВалютныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>УЧ_ПереоценкаВалютныхОстатков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Учетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКурсовйРазницы</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорПодразделения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СчетаПодлежащиеПереоценке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Учетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccountingRegister>
		<Properties>
			<Name>Учетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Учетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Предприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПлана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКРХ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Крахмал</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиДок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ChartsOfAccounts/Учетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<ChartOfAccounts>
		<Properties>
			<Name>Учетный</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтражаетсяВБалансе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБыстрогоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДенежныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Крахмал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

Documents/УЧ_ПереоценкаВалютныхОстатков/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если РучнаяКорректировка Тогда		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Движения документа %1 отредактированы вручную и не могут быть автоматически актуализированы'"), ЭтотОбъект);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.КлючДанных = Ссылка;
		Сообщение.Сообщить();		
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.Учетный.Очистить();
	Движения.Учетный.Записать(Истина); 
	
	Если СчетКурсовйРазницы = ПланыСчетов.Учетный.Счет98() Тогда
		Движения.УЧ_ДоходыИРасходыБудПериодов.Записывать = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетныйОстатки.Счет,
	               |	УчетныйОстатки.Субконто1,
	               |	УчетныйОстатки.Субконто2,
	               |	УчетныйОстатки.Субконто3,
	               |	УчетныйОстатки.СуммаОстаток,
	               |	УчетныйОстатки.ВалютнаяСуммаОстаток,
	               |	УчетныйОстатки.Валюта,
	               |	УчетныйОстатки.Подразделение,
	               |	УчетныйОстатки.СуммаРазвернутыйОстатокДт,
	               |	УчетныйОстатки.СуммаРазвернутыйОстатокКт
	               |ИЗ
	               |	РегистрБухгалтерии.Учетный.Остатки(&Граница, Счет В (&СчетаПереоценки), , Предприятия = &Предприятие) КАК УчетныйОстатки
	               |
	               |ДЛЯ ИЗМЕНЕНИЯ
	               |	РегистрБухгалтерии.Учетный.Остатки";
	Запрос.УстановитьПараметр("Граница",Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетаПереоценки", СчетаПодлежащиеПереоценке.ВыгрузитьКолонку("Счет"));
	Запрос.УстановитьПараметр("Предприятие",Предприятие);
	ВалютныеОстатки = Запрос.Выполнить().Выгрузить();
	
	Если ВалютныеОстатки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КэшКурсовВалют = Новый Соответствие;
	ВалютаПроекта = Предприятие.ОсновнаяВалютаУчета;
	
	СтатьяКурсовыхРазниц = Статья;
	
	Для каждого СтрокаОстатка Из ВалютныеОстатки Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаОстатка.Валюта) Тогда
			СвойстваСчета = УправленческийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаОстатка.Счет);
			Сообщить("Ошибка переоценки валютных счетов.Обнаружены остатки по валютным счетам без указания валюты. Переоценка остатка не производится." + Символы.ПС + "- счет: " + СтрокаОстатка.Счет + " <"+ СтрокаОстатка.Счет.Наименование +">");
			
			Для НомерСубконто = 1 по 3 Цикл
				
				Если СвойстваСчета["ВидСубконто" + НомерСубконто] = Неопределено
					ИЛИ СвойстваСчета["ВидСубконто" + НомерСубконто + "ТолькоОбороты"] Тогда
					Продолжить;
				КонецЕсли;
				
				Сообщить( "	- субконто <" + СвойстваСчета["ВидСубконто" + НомерСубконто + "Наименование"] + "> : """ 
					+ СтрокаОстатка["Субконто" + НомерСубконто] + """");
				КонецЦикла;
				
			Сообщить("Валютный остаток: " + Формат(СтрокаОстатка.ВалютнаяСуммаОстаток, "ЧЦ=15; ЧДЦ=2; ЧН=-") 
				+ " , рублевый остаток: " + Формат(СтрокаОстатка.СуммаОстаток, "ЧЦ=15; ЧДЦ=2; ЧН=-") + "Рекомендуется указать валюту в проводках.");	
			Продолжить;		
		КонецЕсли; 
				
		ПереоцениваютсяРубли = Ложь;
		
		СтруктураКурса = КэшКурсовВалют[СтрокаОстатка.Валюта];
		
		Если СтруктураКурса = Неопределено Тогда
			СтруктураКурса = РегистрыСведений.КурсыВалют.СрезПоследних(Дата, Новый Структура("Валюта", СтрокаОстатка.Валюта))[0];
			КэшКурсовВалют.Вставить(СтрокаОстатка.Валюта, СтруктураКурса);
		КонецЕсли;
		
	    ОстатокВал = СтрокаОстатка.ВалютнаяСуммаОстаток;
		Остаток    = СтрокаОстатка.СуммаОстаток;
				
		КурсВал = сабРаботаСКурсамиВалют.ЗаполнитьДанныеЛокальногоКурсаДляВалюты(СтрокаОстатка.Валюта, ВалютаПроекта, Дата).Курс;
		РасчетныйОстаток = ОстатокВал * КурсВал;
		
		СуммаПереоценки = РасчетныйОстаток - Остаток;
		
		Если СуммаПереоценки = 0 Тогда
			Продолжить;		
		КонецЕсли; 
		
		Проводка = Движения.Учетный.Добавить();
		Проводка.Регистратор = Ссылка;
		Проводка.Период = Дата;
		Проводка.СценарийПлана = Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина);
		Проводка.Предприятия = Предприятие;
		Проводка.Содержание = "Переоценка валютных остатков";
		
		СубконтоОст1 = УЧ_Сервер.ПолучитьСубконто(1, СтрокаОстатка.Счет.ПолучитьОбъект());
		СубконтоОст2 = УЧ_Сервер.ПолучитьСубконто(2, СтрокаОстатка.Счет.ПолучитьОбъект());
		
		Если СуммаПереоценки < 0 Тогда
			Проводка.СчетДт = СчетКурсовйРазницы;
			УЧ_Сервер.УстановитьСубконто(Проводка.СубконтоДт, СчетКурсовйРазницы , 1, Статья);
			
			Если СчетКурсовйРазницы = ПланыСчетов.Учетный.Счет98() И (СубконтоОст1 = "Кассы" ИЛИ СубконтоОст1 = "Банковские счета") Тогда
				УЧ_Сервер.УстановитьСубконто(Проводка.СубконтоДт, СчетКурсовйРазницы, 1, СтрокаОстатка.Субконто1);
			ИначеЕсли СчетКурсовйРазницы = ПланыСчетов.Учетный.Счет98() И (СубконтоОст2 = "Кассы" ИЛИ СубконтоОст2 = "Банковские счета") Тогда
				УЧ_Сервер.УстановитьСубконто(Проводка.СубконтоДт, СчетКурсовйРазницы, 2, СтрокаОстатка.Субконто2);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(КорПодразделения) И Проводка.СчетДт.УчетПоПодразделениям Тогда 
				Проводка.ПодразделениеДт = КорПодразделения;	
			ИначеЕсли Проводка.СчетДт.УчетПоПодразделениям Тогда 
				Проводка.ПодразделениеДт = СтрокаОстатка.Подразделение;
			КонецЕсли;
			
			Проводка.СчетКт = СтрокаОстатка.Счет;
								
			УЧ_Сервер.УстановитьСубконто(Проводка.СубконтоКт, СтрокаОстатка.Счет , 1, СтрокаОстатка.Субконто1);
			УЧ_Сервер.УстановитьСубконто(Проводка.СубконтоКт, СтрокаОстатка.Счет , 2, СтрокаОстатка.Субконто2);
			
			Если Не ЗначениеЗаполнено(СтрокаОстатка.Субконто3) Тогда
				ТекСубконто3 = Справочники.Субконто.ПустаяСсылка();
			Иначе
				ТекСубконто3 = СтрокаОстатка.Субконто3;
			КонецЕсли;
			
			УЧ_Сервер.УстановитьСубконто(Проводка.СубконтоКт, СтрокаОстатка.Счет , 3, ТекСубконто3);
			
			Если Проводка.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Статьи ДДС", Истина)) <> Неопределено и не ЗначениеЗаполнено(Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Статьи затрат", Истина)]) Тогда 
				Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Статьи ДДС", Истина)] = Предприятие.УчетнаяПолитика.КурсовыеРазницыРасход;						
		    КонецЕсли;

			
			Если Проводка.СчетКт.УчетПоПодразделениям Тогда 
				Проводка.ПодразделениеКт = СтрокаОстатка.Подразделение;
			КонецЕсли;
			
			//Если Проводка.СчетКт.УчетПоЦФО Тогда
			//	Проводка.ЦФО = Предприятие;
			//	Проводка.ПодразделениеЦФО = ?(ЗначениеЗаполнено(СтрокаОстатка.Подразделение), СтрокаОстатка.Подразделение, Предприятие.ВидДеятельности);
			//КонецЕсли;

			Проводка.ВалютаКт = СтрокаОстатка.Валюта;
			
			Если ПереоцениваютсяРубли Тогда
				Проводка.ВалютнаяСуммаКт = - СуммаПереоценки;
			Иначе
				Проводка.Сумма = - СуммаПереоценки;
			КонецЕсли;
			
			Проводка.Содержание = "Переоценка валюты " + СтрокаОстатка.Валюта + " на " + строка(Дата)+ ". Курс - " + КурсВал;
		Иначе 
			Проводка.СчетДт = СтрокаОстатка.Счет;
			Проводка.СчетКт = СчетКурсовйРазницы;
			
			УЧ_Сервер.УстановитьСубконто(Проводка.СубконтоДт, СтрокаОстатка.Счет, 1, СтрокаОстатка.Субконто1);
			УЧ_Сервер.УстановитьСубконто(Проводка.СубконтоДт, СтрокаОстатка.Счет, 2, СтрокаОстатка.Субконто2);
			
			Если Не ЗначениеЗаполнено(СтрокаОстатка.Субконто3) Тогда
				ТекСубконто3 = Справочники.Субконто.ПустаяСсылка();
			Иначе
				ТекСубконто3 = СтрокаОстатка.Субконто3;
			КонецЕсли;
			
			УЧ_Сервер.УстановитьСубконто(Проводка.СубконтоДт, СтрокаОстатка.Счет, 3, ТекСубконто3);
			
			Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Статьи ДДС", Истина)) <> Неопределено и не ЗначениеЗаполнено(Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Статьи затрат", Истина)]) Тогда  
				Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Статьи ДДС", Истина)] = Предприятие.УчетнаяПолитика.КурсовыеРазницыДоход;						
		   КонецЕсли;
		   
			Если Проводка.СчетДт.УчетПоПодразделениям Тогда 
				Проводка.ПодразделениеДт = СтрокаОстатка.Подразделение;
			КонецЕсли;
			
			//Если Проводка.СчетДт.УчетПоЦФО Тогда
			//	Проводка.ЦФО = Предприятие;
			//	Проводка.ПодразделениеЦФО = ?(ЗначениеЗаполнено(СтрокаОстатка.Подразделение), СтрокаОстатка.Подразделение, Предприятие.ВидДеятельности);
			//КонецЕсли;

			Проводка.ВалютаДт = СтрокаОстатка.Валюта;
			
			УЧ_Сервер.УстановитьСубконто(Проводка.СубконтоКт, СчетКурсовйРазницы, 1, Статья);
			
			Если СчетКурсовйРазницы = ПланыСчетов.Учетный.Счет98() И (СубконтоОст1 = "Кассы" ИЛИ СубконтоОст1 = "Банковские счета") Тогда
				УЧ_Сервер.УстановитьСубконто(Проводка.СубконтоКт, СчетКурсовйРазницы, 1, СтрокаОстатка.Субконто1);
			ИначеЕсли СчетКурсовйРазницы = ПланыСчетов.Учетный.Счет98() И (СубконтоОст2 = "Кассы" ИЛИ СубконтоОст2 = "Банковские счета") Тогда
				УЧ_Сервер.УстановитьСубконто(Проводка.СубконтоКт, СчетКурсовйРазницы, 2, СтрокаОстатка.Субконто2);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(КорПодразделения) И Проводка.СчетКт.УчетПоПодразделениям Тогда 
				Проводка.ПодразделениеКт = КорПодразделения;
			ИначеЕсли Проводка.СчетКт.УчетПоПодразделениям Тогда 
				Проводка.ПодразделениеКт = СтрокаОстатка.Подразделение;
			КонецЕсли;
			
			Если ПереоцениваютсяРубли Тогда
				Проводка.ВалютнаяСуммаКт = СуммаПереоценки;
			Иначе
				Проводка.Сумма = СуммаПереоценки;
			КонецЕсли;
			
			Проводка.Содержание = "Переоценка валюты " + СтрокаОстатка.Валюта + " на " + строка(Дата)+ ". Курс - " + КурсВал;
		КонецЕсли;
		
		Если СчетКурсовйРазницы = ПланыСчетов.Учетный.Счет98() Тогда
			Движение = Движения.УЧ_ДоходыИРасходыБудПериодов.Добавить();
			
			Если СуммаПереоценки < 0 Тогда
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Сумма = - СуммаПереоценки;
			Иначе
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Сумма = СуммаПереоценки;
			КонецЕсли;
			
			Движение.Регистратор = Ссылка;
			Движение.Период = Дата;
			Движение.Предприятие = Предприятие;
			Движение.Подразделение = КорПодразделения;
			Движение.Валюта = СтрокаОстатка.Валюта;
			Движение.Субконто1 = СтрокаОстатка.Субконто1;
			Движение.Субконто2 = СтрокаОстатка.Субконто2;
			Движение.Субконто3 = СтрокаОстатка.Субконто3;
			Движение.Счет = СтрокаОстатка.Счет;
			Движение.СчетБудПериодов = СчетКурсовйРазницы;
			Движение.СтатьяБуд = Статья;
		КонецЕсли;
		
	КонецЦикла;
		
	Движения.Учетный.Записать(Истина);
	
КонецПроцедуры

// Эта функция пересчитывает сумму из валюты ВалютаНач по курсу ПоКурсуНач 
// в валюту ВалютаКон по курсу ПоКурсуКон
//
// Параметры:      
//	Сумма          - сумма, которую следует пересчитать;
//	ВалютаНач      - ссылка на элемент справочника Валют;
//                   определяет валюту, из которой надо пересчитывать;
//	ВалютаКон      - ссылка на элемент справочника Валют;
//                   определяет валюту, в которую надо пересчитывать;
// 	ПоКурсуНач     - курс валюты, из которой надо пересчитать;
// 	ПоКурсуКон     - курс валюты, в которую надо пересчитать;
// 	ПоКратностьНач - кратность валюты, из которой надо пересчитать (по умолчанию = 1);
// 	ПоКратностьКон - кратность валюты, в которую надо пересчитать  (по умолчанию = 1);
//
// Возвращаемое значение: 
//  Сумма, пересчитанная в другую валюту
//
Функция ПересчитатьИзВалютыВВалюту(Сумма, ВалютаНач, ВалютаКон, ПоКурсуНач, ПоКурсуКон,
		ПоКратностьНач = 1, ПоКратностьКон = 1) Экспорт

	Если (ВалютаНач = ВалютаКон) Тогда 	// Считаем, что пересчет не нужен.
		Возврат Сумма;
	ИначеЕсли (ПоКурсуНач = ПоКурсуКон) И (ПоКратностьНач = ПоКратностьКон) Тогда 
		Возврат Сумма;
	КонецЕсли;

	Если ПоКурсуНач = 0 Тогда
		ПоКурсуНач = 1;
	КонецЕсли;
	Если ПоКурсуКон = 0 Тогда
		ПоКурсуКон = 1;
	КонецЕсли;
	Если ПоКратностьНач = 0 Тогда
		ПоКратностьНач = 1;
	КонецЕсли;
	Если ПоКратностьКон = 0 Тогда
		ПоКратностьКон = 1;
	КонецЕсли;
	
	Результат = Окр((Сумма * ПоКурсуНач * ПоКратностьКон) / (ПоКурсуКон * ПоКратностьНач), 2);
	Возврат Результат;

КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	РучнаяКорректировка = Ложь;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	РучнаяКорректировка = Ложь;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	сабОбщегоНазначенияБУХ.сабОбработкиЗаполненияУчпетныхДокументовОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры
